Австралия/src/Catalogs/CompanyResourceTypes/CompanyResourceTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CompanyResourceTypes</name>
  <predefined>
    <items>
      <name>AllResources</name>
      <description>All work center types</description>
    </items>
  </predefined>
  <attributes>
    <name>PlanningOnWorkcentersLevel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Capacity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ResourceValue</name>
    <type>
      <types>CatalogRef.Teams</types>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Schedule</name>
    <type>
      <types>CatalogRef.Calendars</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkCenterTypeNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EachOperationForSingleWC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/CompanyResourceTypes/Forms/ItemForm/Module.bsl
#Region FormEventHandlers

// Procedure - event handler OnCreateAtServer of the form.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	SetPlanningIncompleteMark();
	
	PlanningOnWorkcentersLevel = Object.PlanningOnWorkcentersLevel;
	
	// StandardSubsystems.ObjectAttributesLock
	ObjectAttributesLock.LockAttributes(ThisObject);
	// End StandardSubsystems.ObjectAttributesLock
	
	NativeLanguagesSupportServer.OnCreateAtServer(ThisObject, Object);
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	SetVisiblePlanning();
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	
	// StandardSubsystems.ObjectAttributesLock
		ObjectAttributesLock.LockAttributes(ThisObject);
	// End StandardSubsystems.ObjectAttributesLock
	
	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	
	Notify("WorkcentersWereChanged", Object.Ref);
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	NativeLanguagesSupportServer.BeforeWriteAtServer(CurrentObject);
	IsNew = CurrentObject.IsNew();
	
	If PlanningOnWorkcentersLevel <> CurrentObject.PlanningOnWorkcentersLevel And Not CurrentObject.IsNew() Then
		
		CurrentObject.AdditionalProperties.Insert("MarkWorkcentersAvailabilityForDeletion");
		PlanningOnWorkcentersLevel = CurrentObject.PlanningOnWorkcentersLevel;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure PlanningOnWorkcentersLevelOnChange(Item)
	
	SetVisiblePlanning();
	SetPlanningIncompleteMark();
	
EndProcedure

&AtClient
Procedure Attachable_Open(Item, StandardProcessing)
	NativeLanguagesSupportClient.OnOpen(ThisObject, Object, Item, StandardProcessing);
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

#Region LibrariesHandlers

// StandardSubsystems.ObjectAttributesLock

&AtClient
Procedure Attachable_AllowObjectAttributesEditing(Command)
	ObjectAttributesLockClient.AllowObjectAttributeEdit(ThisObject);
EndProcedure

// End StandardSubsystems.ObjectAttributesLock

#EndRegion

#EndRegion

#Region Private

&AtClient
Procedure SetVisiblePlanning()
	
	IsVisiblePlanning = Not Object.PlanningOnWorkcentersLevel;
	
	Items.GroupPlanningAttributes.Visible = IsVisiblePlanning;
	Items.EachOperationForSingleWC.Visible = Not IsVisiblePlanning;
	
EndProcedure

&AtServer
Procedure SetPlanningIncompleteMark()
	
	Items.Capacity.AutoMarkIncomplete = False;
	Items.Schedule.AutoMarkIncomplete = False;
	
	If Not Object.PlanningOnWorkcentersLevel Then
		
		UsePlanning = Constants.UseProductionPlanning.Get();
		
		If UsePlanning Then
			Items.Capacity.AutoMarkIncomplete = True;
			Items.Schedule.AutoMarkIncomplete = True;
		EndIf;
		
	EndIf;

EndProcedure

#EndRegion
